In [1]:
%config Completer.use_jedi = False

In [2]:
import pandas as pd
import sqlite3 as db

In [18]:
# reading only SQL and connecting to DB

In [25]:
conn = db.connect('sqlite_pandas.db')

In [26]:
db_cursor=conn.cursor()

In [28]:
db_cursor.execute("CREATE TABLE IF NOT EXISTS employees (empid INTEGER PRIMARY KEY,firstname NVARCHAR(50), lastname NVARCHAR(50) );")

In [29]:
db_cursor.execute("SELECT * from sqlite_master where type='table';")

In [30]:
db_cursor.fetchall()

[('table',
  'employees',
  'employees',
  2,
  'CREATE TABLE employees (empid INTEGER PRIMARY KEY,firstname NVARCHAR(50), lastname NVARCHAR(50) )')]

In [31]:
db_cursor.execute("INSERT into employees VALUES (1,'Jane','Doe')")
db_cursor.execute("INSERT into employees VALUES (2,'Tifanny','Brown')")
db_cursor.execute("INSERT into employees VALUES (3,'Blake','Watson')")

In [32]:
new_emp=[(4,'Dan','White'),(5,'Hermoinie','Granger'),(6,'Harry','Potter'),(7,'Severus','Snape'),]
db_cursor.executemany('INSERT INTO employees VALUES (?,?,?)',new_emp)

In [33]:
db_cursor.execute("SELECT * FROM employees;")

In [34]:
print(db_cursor.fetchall())

[(1, 'Jane', 'Doe'), (2, 'Tifanny', 'Brown'), (3, 'Blake', 'Watson'), (4, 'Dan', 'White'), (5, 'Hermoinie', 'Granger'), (6, 'Harry', 'Potter'), (7, 'Severus', 'Snape')]

In [35]:
conn.commit()

In [36]:
db_cursor.close()
conn.close()

In [19]:
# Using SQLITE with pandas

In [37]:
con=db.connect('sqlite_pandas.db')

In [38]:
df_employees=pd.read_sql_query('select * from employees',con)

In [39]:
df_employees

   empid  firstname lastname
0      1       Jane      Doe
1      2    Tifanny    Brown
2      3      Blake   Watson
3      4        Dan    White
4      5  Hermoinie  Granger
5      6      Harry   Potter
6      7    Severus    Snape

In [40]:
# remove first employee
df_new=df_employees[1:]

In [41]:
df_new

   empid  firstname lastname
1      2    Tifanny    Brown
2      3      Blake   Watson
3      4        Dan    White
4      5  Hermoinie  Granger
5      6      Harry   Potter
6      7    Severus    Snape

In [43]:
df_new.to_sql('employees',con,if_exists='replace')

6

In [45]:
pd.read_sql_query('select * from employees',con)

   index  empid  firstname lastname
0      1      2    Tifanny    Brown
1      2      3      Blake   Watson
2      3      4        Dan    White
3      4      5  Hermoinie  Granger
4      5      6      Harry   Potter
5      6      7    Severus    Snape

In [46]:
con.close()